<?php

namespace Database\Seeders;

use App\Models\RequiredDocument;
use Illuminate\Database\Seeder;

class RequiredDocumentsSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $requiredDocuments = [
            [/*1*/    'name' => 'استمارة', 'description' => 'استمارة'],
            [/*2*/    'name' => 'شهادة عمل/قرار التعاقد/قرار فسخ العقد', 'description' => 'شهادة عمل أو نسخة من قرار التعاقد أو قرار فسخ العقد'],
            [/*3*/    'name' => 'شهادة عائلية', 'description' => 'شهادة عائلية (أو كفالة ليتيم الأبوين)'],
            [/*4*/    'name' => 'شهادة وفاة', 'description' => 'شهادة وفاة'],
            [/*5*/    'name' => 'شهادة عدم الزواج', 'description' => 'شهادة عدم الزواج للبنت فوق 21 سنة'],
            [/*6*/    'name' => 'شهادة عدم الانتساب إلى CNAS', 'description' => 'شهادة عدم الانتساب إلى CNAS للبنت +21 سنة'],
            [/*7*/    'name' => 'شهادة عدم الانتساب إلى CASNOS', 'description' => 'شهادة عدم الانتساب إلى CASNOS للبنت +21 سنة'],
            [/*8*/    'name' => 'صك بريدي', 'description' => 'صك بريدي مشطوب للمستفيد(ة)'],
            [/*9*/    'name' => 'شهادة عائلية', 'description' => 'شهادة عائلية تحمل عبارة "غير مطلقة"'],
            [/*10*/   'name' => 'شهادة وفاة الزوج', 'description' => 'شهادة وفاة الزوج في حالة عدم تسجيل عبارة متوفي على الشهادة العائلية'],
            [/*11*/   'name' => 'شهادة عدم الانتساب إلى CNAS', 'description' => 'شهادة عدم الانتساب إلى CNAS. أو الانتساب مع تسجيل عبارة معاش منقول'],
            [/*12*/   'name' => 'شهادة عدم الانتساب إلى CASNOS', 'description' => 'شهادة عدم الانتساب إلى CASNOS. أو الانتساب مع وقف النشاط'],
            [/*13*/   'name' => 'شهادة عدم تكرار الزواج', 'description' => 'شهادة عدم تكرار الزواج'],
            [/*14*/   'name' => 'صك بريدي', 'description' => 'صك بريدي مشطوب للمستفيدة'],
            [/*15*/   'name' => 'شهادة عائلية/كفالة CNAS', 'description' => 'شهادة عائلية أو كفالة صادرة من CNAS'],
            [/*16*/   'name' => 'شهادة عدم الانتساب CNAS', 'description' => 'شهادة عدم الانتساب CNAS للذين تجاوزو 21 سنة'],
            [/*17*/   'name' => 'شهادة عدم الزواج', 'description' => 'شهادة عدم الزواج للذين تجاوزو 21 سنة'],
            [/*18*/   'name' => 'بطاقة الإعاقة', 'description' => 'نسخة من بطاقة الإعاقة مصادق عليها'],
            [/*19*/   'name' => 'شهادة عائلية', 'description' => 'شهادة عائلية'],
            [/*20*/   'name' => 'تقرير طبي', 'description' => 'تقرير طبي يحدد أدوات الإعاقة الضرورية'],
            [/*21*/   'name' => 'شهادة عدم التكفل من طرف CNAS', 'description' => 'شهادة عدم التكفل من طرف CNAS'],
            [/*22*/   'name' => 'قرار التعاقد/فسخ العقد', 'description' => 'نسخة من قرار التعاقد أو قرار فسخ العقد'],
            [/*23*/   'name' => 'شهادة الاعلام على التقاعد', 'description' => 'نسخة من شهادة الاعلام على التقاعد'],
            [/*24*/   'name' => 'شهادة توقيف الراتب/توقيف المعاش', 'description' => 'شهادة توقيف الراتب أو شهادة توقيف المعاش'],
            [/*25*/   'name' => 'مجمل الخدمات', 'description' => 'مجمل الخدمات'],
            [/*26*/   'name' => 'شهادة تبرئة الذمة', 'description' => 'شهادة تبرئة الذمة'],
            [/*27*/   'name' => 'شهادة وفاة العامل', 'description' => 'شهادة وفاة العامل'],
            [/*28*/   'name' => 'شهادة ميلاد المتوفي', 'description' => 'شهادة ميلاد المتوفي (12 أو 14)'],
            [/*29*/   'name' => 'نسخة من ب ت', 'description' => 'نسخة من ب ت و لمودع الملف'],
            [/*30*/   'name' => 'مجمل الخدمات', 'description' => 'مجمل الخدمات بالنسبة للمتوفي أثناء الخدمة'],
            [/*31*/   'name' => 'صك بريدي', 'description' => 'صك مشطوب للمتوفي(ة)'],
            [/*32*/   'name' => 'شهادة وفاة الزوج', 'description' => 'شهادة وفاة الزوج(ة)'],
            [/*33*/   'name' => 'شهادة وفاة الابن', 'description' => 'شهادة وفاة الابن(ة)'],
            [/*34*/   'name' => 'شهادة ميلاد للابن المتوفي', 'description' => 'شهادة ميلاد رقم 12 للابن المتوفي(ة)'],
            [/*35*/   'name' => 'شهادة وفاة الوالد', 'description' => 'شهادة وفاة الوالد(ة)'],
            [/*36*/   'name' => 'شهادة عائلية للوالد', 'description' => 'شهادة عائلية للوالد(ة)'],
            [/*37*/   'name' => 'شهادة عمل', 'description' => 'شهادة عمل'],
            [/*38*/   'name' => 'عقد القران', 'description' => 'عقد القران'],
            [/*39*/   'name' => 'تقرير طبي', 'description' => 'تقرير طبي'],
            [/*40*/   'name' => 'فاتورة بالمواصفات القانونية', 'description' => 'فاتورة بالمواصفات القانونية'],
            [/*41*/   'name' => 'شهادة عائلية/شهادة اكتساب الحقوق', 'description' => 'شهادة عائلية أو شهادة اكتساب الحقوق مستخرجة من الضمان الاجتماعي للمكفولين'],
            [/*42*/   'name' => 'شهادة عدم الانتساب إلى CNAS', 'description' => 'شهادة عدم الانتساب إلى CNAS للزوجة الغير عاملة والبنت +21 سنة والغير متزوجة'],
            [/*43*/   'name' => 'شهادة عدم الانتساب إلى CASNOS', 'description' => 'شهادة عدم الانتساب إلى CASNOS للزوجة الغير عاملة والبنت +21 سنة والغير متزوجة'],
            [/*44*/   'name' => 'شهادة عدم الزواج', 'description' => 'شهادة عدم الزواج للبنت +21 سنة'],
            [/*45*/   'name' => 'شهادة عائلية/شهادة اكتساب الحقوق', 'description' => 'شهادة عائلية أو شهادة اكتساب الحقوق  من طرف صندوق الضمان الاجتماعي'],
            [/*46*/   'name' => 'تقرير طبي', 'description' => 'تقرير طبي يحدد حاجة المعني للعلاج (مؤشرة من قبل طبيب مختص)'],
            [/*47*/   'name' => 'وصل مساهمة مؤشر', 'description' => 'وصل مساهمة مؤشر من قبل محاسب اللجنة'],
            [/*48*/   'name' => 'صك بريدي', 'description' => 'صك بريدي مشطوب'],
            [/*49*/   'name' => 'شهادة عائلية', 'description' => 'شهادة عائلية للأرملة الغير عاملة'],
            [/*50*/   'name' => 'شهادة متضرر/محضر تدخل', 'description' => 'شهادة متضرر أو محضر تدخل'],
            [/*51*/   'name' => 'بطاقة تقنية', 'description' => 'بطاقة تقنية لخبير لتقييم حجم الخسائر'],
            [/*52*/   'name' => 'محضر معاينة', 'description' => 'محضر معاينة معد من اللجنة'],
            [/*53*/   'name' => 'صك بريدي', 'description' => 'صك بريدي مشطوب للمتضرر(ة)'],
            [/*54*/   'name' => 'شهادة عمل/قرار التعاقد/قرار فسخ العقد/شهادة إدارية', 'description' => 'شهادة عمل أو نسخة من قرار التعاقد أو قرار فسخ العقد أو شهادة إدارية للمرضى اللذين هم في حالة عطلة طويلة المدى'],
            [/*55*/   'name' => 'وثيقة تثبت الحاجة للمساعدة', 'description' => 'وثيقة تثبت الحاجة للمساعدة'],
            [/*56*/   'name' => 'عقد الزواج', 'description' => 'عقد الزواج'],
            [/*57*/   'name' => 'كشف الراتب', 'description' => 'كشف الراتب حديث'],
            [/*58*/   'name' => 'عقد السلفة', 'description' => 'عقد السلفة'],
            [/*59*/   'name' => 'وكالة الاقتطاع', 'description' => 'وكالة الاقتطاع'],
            [/*60*/   'name' => 'شهادة عمل', 'description' => 'شهادة عمل حديثة'],
            [/*61*/   'name' => 'كشف مجمل الخدمات', 'description' => 'كشف مجمل الخدمات'],
            [/*62*/   'name' => 'وثيقة تثبت الحاجة للقرض', 'description' => 'وثيقة تثبت الحاجة لهذا القرض'],
            [/*63*/   'name' => 'شهادة الإعفاء من الديون', 'description' => 'شهادة الإعفاء من الديون تجاه اللجنة'],
            [/*64*/   'name' => 'عقد السلفة', 'description' => 'عقد السلفة مصادق عليه'],
            [/*65*/   'name' => 'وكالة الاقتطاع', 'description' => 'وكالة الاقتطاع مصادق عليها'],
            [/*66*/   'name' => 'كشف الراتب', 'description' => 'كشف الراتب للشهر قبل ايداع الملف'],
            [/*67*/   'name' => 'وثيقة تثبت الشراء', 'description' => 'وثيقة تثبت أن المعني قد شرع في عملية الشراء'],
            [/*68*/   'name' => 'رخصة بناء', 'description' => 'رخصة بناء سارية المفعول عند تاريخ ايداع الملف'],
            [/*69*/   'name' => 'صورة شمسية', 'description' => '01 صورة شمسية للتلميذ(ة) المشارك(ة)'],
            [/*70*/   'name' => 'كشف النقاط', 'description' => 'نسخة من كشف النقاط'],
            [/*71*/   'name' => 'شهادة عائلية', 'description' => 'شهادة عائلية في حالة اصطحاب الأسرة'],
            [/*72*/   'name' => 'نسخة من ب.ت. ', 'description' => 'نسخة من ب.ت. وللمشاركين البالغين'],
            [/*73*/   'name' => 'صورة شمسية', 'description' => 'صورة شمسية للموظف'],
            [/*74*/   'name' => 'وصل تسديد المساهمة', 'description' => 'وصل تسديد المساهمة'],
            [/*75*/   'name' => 'جواز السفر', 'description' => 'نسخة من جواز السفر مؤشر عليه الخروج والدخول'],
            [/*76*/   'name' => 'تذكرة السفر', 'description' => 'تذكرة السفر'],
            [/*77*/   'name' => 'جواز السفر', 'description' => 'نسخة من جواز السفر لاتقل صلاحيته عن ستة أشهر'],
            [/*78*/   'name' => 'نسخة من ب.ت. و', 'description' => 'نسخة من ب.ت. و'],
            

        ];

        foreach ($requiredDocuments as $requiredDocument) {
            RequiredDocument::create($requiredDocument);
        }
    }
}
